DataProcessors/бит_ПроверкаДатыПоверки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>бит_ПроверкаДатыПоверки</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаПоказанийПодкрутки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Счетчики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВладелецСчетчика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
								<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПоверки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Здание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Квартира</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_Квартиры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счетчик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_Счетчики</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Улица</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СписокУлиц</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицаЗаполнения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВладелецСчетчика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
								<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПоверки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счетчик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_Счетчики</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/бит_ПоверкаСчетчиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ПоверкаСчетчиков</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПоверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СнятНаПоверку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Счетчики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_СчетчикиНаУслугахОбщий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_СчетчикиНаУслугахОбщий</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипСчетчика</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипСчетчика</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СпособыРасчетаПоУслугам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРаспределения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СпособыРаспределения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Многотарифный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестоУстановкиСчетчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Комнаты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Приоритет</Name>
					<Comment>Приоритет общедомового счетчика</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьСтавкуПоСчетчику</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПоставщикиУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусКвартиры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусыКвартиры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыКвартиры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РежимПотребления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_РежимыПотребленияУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетчикСЗависимымиУслугами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнаяУслуга</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьПравилоУменьшения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчетаУменьшения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СпособыРасчетаПоУслугам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРаспределенияУменьшения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СпособыРаспределения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Счетчики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/бит_ТипСчетчика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_ТипСчетчика</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Групповой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Индивидуальный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/бит_ПроверкаДатыПоверки/Ext/ObjectModule.bsl
#Область ЭкспортныеПроцедурыИФункции

// Процедура заполнения табличной части.
//
Процедура ВыполнитьПроверку() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоверкаСЧ.Счетчик,
	|	ПоверкаСЧ.ДатаПоверки,
	|	ТабСч.ВладелецСчетчика,
	|	ТабСч.Улица,
	|	ТабСч.Здание,
	|	ТабСч.Квартира
	|ИЗ
	|	(ВЫБРАТЬ
	|		бит_ПоверкаСчетчиковСрезПоследних.Счетчик КАК Счетчик,
	|		бит_ПоверкаСчетчиковСрезПоследних.ДатаПоверки КАК ДатаПоверки
	|	ИЗ
	|		РегистрСведений.бит_ПоверкаСчетчиков.СрезПоследних(&Дата, ) КАК бит_ПоверкаСчетчиковСрезПоследних
	|	ГДЕ
	|		(НЕ бит_ПоверкаСчетчиковСрезПоследних.СнятНаПоверку)) КАК ПоверкаСЧ
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик КАК Счетчик,
	|			бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект КАК ВладелецСчетчика,
	|			бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект.УлицаЛицевогоСчета КАК Улица,
	|			бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект.Здание КАК Здание,
	|			бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект.Квартира КАК Квартира
	|		ИЗ
	|			РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(&Дата, ТипСчетчика = ЗНАЧЕНИЕ(Перечисление.бит_ТипСчетчика.Индивидуальный)) КАК бит_СчетчикиНаУслугахОбщийСрезПоследних
	|		ГДЕ
	|			бит_СчетчикиНаУслугахОбщийСрезПоследних.Использовать
	|		
	|		СГРУППИРОВАТЬ ПО
	|			бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик,
	|			бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект,
	|			бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект.УлицаЛицевогоСчета,
	|			бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект.Здание,
	|			бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект.Квартира
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик,
	|			бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект,
	|			бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект.Улица,
	|			бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект.Ссылка,
	|			ЗНАЧЕНИЕ(Справочник.бит_Квартиры.ПустаяСсылка)
	|		ИЗ
	|			РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(&Дата, ТипСчетчика = ЗНАЧЕНИЕ(Перечисление.бит_ТипСчетчика.Групповой)) КАК бит_СчетчикиНаУслугахОбщийСрезПоследних
	|		ГДЕ
	|			бит_СчетчикиНаУслугахОбщийСрезПоследних.Использовать) КАК ТабСч
	|		ПО ПоверкаСЧ.Счетчик = ТабСч.Счетчик
	|ГДЕ
	|	ПоверкаСЧ.ДатаПоверки < &Дата";
	
	Запрос.УстановитьПараметр("Дата", КонецДня(ТекущаяДата()));
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Счетчики.Загрузить(Результат);

КонецПроцедуры

// Процедура заполнения табличной части.
//
Функция ВыполнитьПроверкуФункция() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоверкаСЧ.Счетчик,
	|	ПоверкаСЧ.ДатаПоверки,
	|	ТабСч.ВладелецСчетчика,
	|	ТабСч.Улица,
	|	ТабСч.Здание,
	|	ТабСч.Квартира
	|ИЗ
	|	(ВЫБРАТЬ
	|		бит_ПоверкаСчетчиковСрезПоследних.Счетчик КАК Счетчик,
	|		бит_ПоверкаСчетчиковСрезПоследних.ДатаПоверки КАК ДатаПоверки
	|	ИЗ
	|		РегистрСведений.бит_ПоверкаСчетчиков.СрезПоследних(&Дата, ) КАК бит_ПоверкаСчетчиковСрезПоследних
	|	ГДЕ
	|		(НЕ бит_ПоверкаСчетчиковСрезПоследних.СнятНаПоверку)) КАК ПоверкаСЧ
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик КАК Счетчик,
	|			бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект КАК ВладелецСчетчика,
	|			бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект.УлицаЛицевогоСчета КАК Улица,
	|			бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект.Здание КАК Здание,
	|			бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект.Квартира КАК Квартира
	|		ИЗ
	|			РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(&Дата, ТипСчетчика = ЗНАЧЕНИЕ(Перечисление.бит_ТипСчетчика.Индивидуальный)) КАК бит_СчетчикиНаУслугахОбщийСрезПоследних
	|		ГДЕ
	|			бит_СчетчикиНаУслугахОбщийСрезПоследних.Использовать
	|		
	|		СГРУППИРОВАТЬ ПО
	|			бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик,
	|			бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект,
	|			бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект.УлицаЛицевогоСчета,
	|			бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект.Здание,
	|			бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект.Квартира
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик,
	|			бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект,
	|			бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект.Улица,
	|			бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект.Ссылка,
	|			ЗНАЧЕНИЕ(Справочник.бит_Квартиры.ПустаяСсылка)
	|		ИЗ
	|			РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(&Дата, ТипСчетчика = ЗНАЧЕНИЕ(Перечисление.бит_ТипСчетчика.Групповой)) КАК бит_СчетчикиНаУслугахОбщийСрезПоследних
	|		ГДЕ
	|			бит_СчетчикиНаУслугахОбщийСрезПоследних.Использовать) КАК ТабСч
	|		ПО ПоверкаСЧ.Счетчик = ТабСч.Счетчик
	|ГДЕ
	|	ПоверкаСЧ.ДатаПоверки < &Дата";
	
	Запрос.УстановитьПараметр("Дата", КонецДня(ТекущаяДата()));
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;

КонецФункции

#КонецОбласти
